window.costAnalysis =
{
    "costAnalysisByDay": {
        "viewType": "day",
        "dataCycle": "2022-09-30 23:59:59",
        "statistics": [
            {
                "sCycle": "2022年09月29日累计",
                "sAmount": '--',
                "sPreCycle": "前一天同期",
                "sPreAmount": '--',
                "sRatio": '--'
            },
            {
                "sCycle": "2022年09月累计",
                "sAmount": "0",
                "sPreCycle": "上月同期",
                "sPreAmount": "8954.58",
                "sRatio": "0"
            },
            {
                "sCycle": "2022年第3季度累计",
                "sAmount": "18163.88",
                "sUnit": "$",
                "sPreCycle": "上季度同期",
                "sPreAmount": "11596.02",
                "sPreUnit": "$",
                "sRatio": "56.54"
            },
            {
                "sCycle": "2022年累计",
                "sAmount": "43128.75",
                "sPreCycle": "上年同期",
                "sPreAmount": "0.00",
                "sRatio": '--'
            }
        ],
        "ratios": [
            {
                "chart": {
                    "id": "productTypeRatio",
                    "title": "日成本构成比例",
                    "midUnit": "¥",
                    "midValue": "22.3",
                    "data": [
                        {
                            "name": "云服务器 ECS",
                            "value": "4.56"
                        },
                        {
                            "name": "负载均衡",
                            "value": "2.56"
                        },
                        {
                            "name": "NAT网关",
                            "value": "1.56"
                        },
                        {
                            "name": "弹性公网IP",
                            "value": "14.56"
                        }
                    ]
                }
            },
            {
                "chart": {
                    "id": "providerTypeRatio",
                    "title": "日成本云厂商比例",
                    "midUnit": "¥",
                    "midValue": "52",
                    "data": [
                        {
                            "name": "阿里云",
                            "value": "52"
                        }
                    ]
                }
            },
            {
                "chart": {
                    "id": "chargeTypeRatio",
                    "title": "云服务器日花费付费类型",
                    "midUnit": "¥",
                    "midValue": "134",
                    "data": [
                        {
                            "name": "按量付费",
                            "value": "110"
                        },
                        {
                            "name": "包年包月",
                            "value": "24"
                        }
                    ]
                }
            }
        ],
        "costTrend": {
            "chart": {
                "id": "costTrend",
                "title": "成本走势",
                "xData": [
                    "2022-09-17",
                    "2022-09-18",
                    "2022-09-19",
                    "2022-09-20",
                    "2022-09-21",
                    "2022-09-22",
                    "2022-09-23",
                    "2022-09-24",
                    "2022-09-25",
                    "2022-09-26",
                    "2022-09-27",
                    "2022-09-28",
                    "2022-09-29",
                    "2022-09-30"
                ],
                "series": [
                    {
                        "name": "成本(本期)",
                        "type": "bar",
                        "yAxisIndex": 0,
                        "data": [
                            '--', "64.24", "54.23", "74.24", "74.24", "74.24", "74.24",
                            "14.24", "44.24", "14.24", "74.24", "24.24", "74.24", "74.24"
                        ]
                    },
                    {
                        "name": "成本(上一年同期)",
                        "type": "bar",
                        "yAxisIndex": 0,
                        "data": [
                            "14.24", "12.24", "33.24", "35.24", "46.24", "55.24", "60.24",
                            "63.24", "77.24", "92.24", "22.24", "55.24", "90.24", "88.24"
                        ]
                    },
                    {
                        "name": "环比上一天",
                        "type": "line",
                        "yAxisIndex": 1,
                        "data": [
                            '--', "12.24", "33.24", "35.24", "46.24", "55.24", "60.24",
                            "63.24", "77.24", "92.24", "22.24", "55.24", "90.24", "88.24"
                        ]
                    },
                    {
                        "name": "同比上一年",
                        "type": "line",
                        "yAxisIndex": 1,
                        "data": [
                            '--', "12.24", "33.24", "35.24", "46.24", "55.24", "60.24",
                            "63.24", "77.24", "92.24", "22.24", "55.24", "90.24", "88.24"
                        ]
                    }
                ],
                "yTitle": ["成本 (¥)", "变化率 (%)"],
                "tooltipUnit": {
                    "bar": "¥",
                    "line": "%"
                }
            }
        }
    },
    "costAnalysisByMonth": {
        "viewType": "month",
        "dataCycle": "2022-09-30 23:59:59",
        "statistics": [
            {
                "sCycle": "2022年09月29日累计",
                "sAmount": "687.092",
                "sPreCycle": "前一天同期",
                "sPreAmount": "174.24",
                "sRatio": "25.73"
            },
            {
                "sCycle": "2022年09月累计",
                "sAmount": "715.08",
                "sPreCycle": "上月同期",
                "sPreAmount": "8954.58",
                "sRatio": "-92.01"
            },
            {
                "sCycle": "2022年第3季度累计",
                "sAmount": "18163.88",
                "sPreCycle": "上季度同期",
                "sPreAmount": "11596.02",
                "sRatio": "56.54"
            },
            {
                "sCycle": "2022年累计",
                "sAmount": "43128.75",
                "sPreCycle": "上年同期",
                "sPreAmount": "0.00",
                "sRatio": '--'
            }
        ],
        "ratios": [
            {
                "chart": {
                    "id": "productTypeRatio",
                    "title": "月成本构成比例",
                    "midUnit": "¥",
                    "midValue": "652.3",
                    "data": [
                        {
                            "name": "云服务器 ECS",
                            "value": "294.56"
                        },
                        {
                            "name": "负载均衡",
                            "value": "224.56"
                        },
                        {
                            "name": "NAT网关",
                            "value": "184.56"
                        },
                        {
                            "name": "弹性公网IP",
                            "value": "104.56"
                        }
                    ]
                }
            },
            {
                "chart": {
                    "id": "providerTypeRatio",
                    "title": "月成本云厂商比例",
                    "midUnit": "¥",
                    "midValue": "5262",
                    "data": [
                        {
                            "name": "阿里云",
                            "value": "5222"
                        }
                    ]
                }
            },
            {
                "chart": {
                    "id": "chargeTypeRatio",
                    "title": "云服务器月花费付费类型",
                    "midUnit": "¥",
                    "midValue": "15600",
                    "data": [
                        {
                            "name": "按量付费",
                            "value": "8500"
                        },
                        {
                            "name": "包年包月",
                            "value": "7100"
                        }
                    ]
                }
            }
        ],
        "costTrend": {
            "chart": {
                "id": "costTrend",
                "title": "成本走势",
                "xData": [
                    "2021-09",
                    "2021-10",
                    "2021-11",
                    "2021-12",
                    "2022-01",
                    "2022-02",
                    "2022-03",
                    "2022-04",
                    "2022-05",
                    "2022-06",
                    "2022-07",
                    "2022-08",
                    "2022-09",
                    "2022-10"
                ],
                "series": [
                    {
                        "name": "成本(本期)",
                        "type": "bar",
                        "yAxisIndex": 0,
                        "data": [
                            "174.24", "164.24", "154.24", "174.24", "174.24", "174.24", "174.24",
                            "174.24", "474.24", "174.24", "174.24", "274.24", "174.24", "74.24"
                        ]
                    },
                    {
                        "name": "成本(上一年同期)",
                        "type": "bar",
                        "yAxisIndex": 0,
                        "data": [
                            "174.24", "164.24", "154.24", "174.24", "174.24", "174.24", "174.24",
                            "174.24", "474.24", "174.24", "174.24", "274.24", "174.24", "74.24"
                        ]
                    },
                    {
                        "name": "环比上一天",
                        "type": "line",
                        "yAxisIndex": 1,
                        "data": [
                            "174.24", "164.24", "154.24", "174.24", "174.24", "174.24", "174.24",
                            "174.24", "474.24", "174.24", "174.24", "274.24", "174.24", "74.24"
                        ]
                    },
                    {
                        "name": "同比上一年",
                        "type": "line",
                        "yAxisIndex": 1,
                        "data": [
                            "174.24", "164.24", "154.24", "174.24", "174.24", "174.24", "174.24",
                            "174.24", "474.24", "174.24", "174.24", "274.24", "174.24", "74.24"
                        ]
                    }
                ],
                "yTitle": ["成本 (¥)", "变化率 (%)"],
                "tooltipUnit": {
                    "bar": "¥",
                    "line": "%"
                }
            }
        }
    }
};
window.utilizeAnalysis =
{
    "utilizeAnalysisByDay": {
        "viewType": "day",
        "dataCycle": "2022-09-30 23:59:59",
        "statistics": [
            {
                "sCycle": "CPU平均利用率",
                "sAmount": '--',
                "sUnit": '%',
                "sPreCycle": "前日数据",
                "sPreAmount": '--',
                "sPreUnit": '%',
                "sRatio": '--'
            },
            {
                "sCycle": "内存平均利用率",
                "sAmount": "1.23",
                "sUnit": '%',
                "sPreCycle": "前日数据",
                "sPreAmount": "8954.58",
                "sPreUnit": '%',
                "sRatio": "-90"
            },
            {
                "sCycle": "云服务器",
                "sAmount": "18163",
                "sUnit": '台',
                "sPreCycle": "前日数据",
                "sPreAmount": "11596",
                "sPreUnit": '台',
                "sRatio": "56.54"
            }
        ],
        "ratios": [
            {
                "chart": {
                    "id": "chargeTypeRatio",
                    "title": "服务器付费类型",
                    "midUnit": "台",
                    "midValue": "3939",
                    "data": [
                        {
                            "name": "按量付费",
                            "value": "3100"
                        },
                        {
                            "name": "包年包月",
                            "value": "839"
                        }
                    ]
                }
            },
            {
                "chart": {
                    "id": "providerTypeRatio",
                    "title": "服务器云厂商分布",
                    "midUnit": "台",
                    "midValue": "3939",
                    "data": [
                        {
                            "name": "阿里云",
                            "value": "1900"
                        },
                        {
                            "name": "AWS",
                            "value": "1039"
                        },
                        {
                            "name": "腾讯云",
                            "value": "1000"
                        }
                    ]
                }
            },
            {
                "chart": {
                    "id": "regionTypeRatio",
                    "title": "云服务器地域分布",
                    "midUnit": "台",
                    "midValue": "3939",
                    "data": [
                        {
                            "name": "腾讯-深圳",
                            "value": "2100"
                        },
                        {
                            "name": "腾讯-杭州",
                            "value": "1000"
                        },

                        {
                            "name": "腾讯-北京",
                            "value": "839"
                        }
                    ]
                }
            }
        ],
        "utilizeTrend": {
            "chart": {
                "id": "utilizeTrend",
                "title": "利用率走势",
                "xData": [
                    "2022-09-17",
                    "2022-09-18",
                    "2022-09-19",
                    "2022-09-20",
                    "2022-09-21",
                    "2022-09-22",
                    "2022-09-23",
                    "2022-09-24",
                    "2022-09-25",
                    "2022-09-26",
                    "2022-09-27",
                    "2022-09-28",
                    "2022-09-29",
                    "2022-09-30"
                ],
                "series": [
                    {
                        "name": "CPU",
                        "data": [
                            '--', "64.24", "54.23", "74.24", "74.24", "74.24", "74.24",
                            "14.24", "44.24", "14.24", "74.24", "24.24", "74.24", "74.24"
                        ]
                    },
                    {
                        "name": "内存",
                        "data": [
                            '1.23', "12.24", "33.24", "--", "46.24", "55.24", "60.24",
                            "63.24", "77.24", "92.24", "22.24", "55.24", "90.24", "88.24"
                        ]
                    }
                ],
                "yTitle": ["利用率 (%)"],
                "tooltipUnit": {
                    "line": "%"
                }
            }
        },
        "cpuTrend": {
            "chart": {
                "id": "cpuTrend",
                "title": "CPU利用率分布",
                "xData": [
                    "2022-09-17",
                    "2022-09-18",
                    "2022-09-19",
                    "2022-09-20",
                    "2022-09-21",
                    "2022-09-22",
                    "2022-09-23",
                    "2022-09-24",
                    "2022-09-25",
                    "2022-09-26",
                    "2022-09-27",
                    "2022-09-28",
                    "2022-09-29",
                    "2022-09-30"
                ],
                "series": [
                    {
                        "name": "0%~20%",
                        "data": [
                            '156', "2", "3", "3", "3", "2", "1",
                            "4", "4", "3", "2", "1", "4", "9"
                        ]
                    },
                    {
                        "name": "20%~40%",
                        "data": [
                            '1', "2", "3", "3", "3", "2", "1",
                            "4", "4", "3", "2", "1", "4", "9"
                        ]
                    },
                    {
                        "name": "40%~60%",
                        "data": [
                            '1', "2", "3", "3", "3", "2", "1",
                            "4", "4", "3", "2", "1", "4", "9"
                        ]
                    },
                    {
                        "name": "60%~80%",
                        "data": [
                            '1', "2", "3", "3", "3", "2", "1",
                            "4", "4", "3", "2", "1", "4", "9"
                        ]
                    },
                    {
                        "name": "80%以上",
                        "data": [
                            '1', "2", "3", "3", "3", "2", "1",
                            "4", "4", "3", "2", "1", "4", "9"
                        ]
                    },
                ],
                "yTitle": ["机器数 (个)"],
                "tooltipUnit": {
                    "bar": "个"
                },
                "style": {
                    "stack": "total"
                }
            }
        }
    }
};